ICST-Technion/s22_lab-safety-manager/ESP32 Store Data to Firebase Database.c
{\rtf1\ansi\ansicpg1252\cocoartf2638
\cocoatextscaling0\cocoaplatform0{\fonttbl\f0\fmodern\fcharset0 Courier;}
{\colortbl;\red255\green255\blue255;\red0\green0\blue0;}
{\*\expandedcolortbl;;\cssrgb\c0\c0\c0;}
\paperw11900\paperh16840\margl1440\margr1440\vieww11520\viewh8400\viewkind0
\deftab720
\pard\pardeftab720\partightenfactor0

\f0\fs26 \cf0 \expnd0\expndtw0\kerning0
\outl0\strokewidth0 \strokec2 /*\
  Rui Santos\
  Complete project details at our blog.\
    - ESP32: https://RandomNerdTutorials.com/esp32-firebase-realtime-database/\
    - ESP8266: https://RandomNerdTutorials.com/esp8266-nodemcu-firebase-realtime-database/\
  Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files.\
  The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\
  Based in the RTDB Basic Example by Firebase-ESP-Client library by mobizt\
  https://github.com/mobizt/Firebase-ESP-Client/blob/main/examples/RTDB/Basic/Basic.ino\
*/\
\
#include <Arduino.h>\
#if defined(ESP32)\
  #include <WiFi.h>\
#elif defined(ESP8266)\
  #include <ESP8266WiFi.h>\
#endif\
#include <Firebase_ESP_Client.h>\
\
//Provide the token generation process info.\
#include "addons/TokenHelper.h"\
//Provide the RTDB payload printing info and other helper functions.\
#include "addons/RTDBHelper.h"\
\
// Insert your network credentials\
#define WIFI_SSID "REPLACE_WITH_YOUR_SSID"\
#define WIFI_PASSWORD "REPLACE_WITH_YOUR_PASSWORD"\
\
// Insert Firebase project API Key\
#define API_KEY "REPLACE_WITH_YOUR_FIREBASE_PROJECT_API_KEY"\
\
// Insert RTDB URLefine the RTDB URL */\
#define DATABASE_URL "REPLACE_WITH_YOUR_FIREBASE_DATABASE_URL" \
\
//Define Firebase Data object\
FirebaseData fbdo;\
\
FirebaseAuth auth;\
FirebaseConfig config;\
\
unsigned long sendDataPrevMillis = 0;\
int count = 0;\
bool signupOK = false;\
\
void setup()\{\
  Serial.begin(115200);\
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);\
  Serial.print("Connecting to Wi-Fi");\
  while (WiFi.status() != WL_CONNECTED)\{\
    Serial.print(".");\
    delay(300);\
  \}\
  Serial.println();\
  Serial.print("Connected with IP: ");\
  Serial.println(WiFi.localIP());\
  Serial.println();\
\
  /* Assign the api key (required) */\
  config.api_key = API_KEY;\
\
  /* Assign the RTDB URL (required) */\
  config.database_url = DATABASE_URL;\
\
  /* Sign up */\
  if (Firebase.signUp(&config, &auth, "", ""))\{\
    Serial.println("ok");\
    signupOK = true;\
  \}\
  else\{\
    Serial.printf("%s\\n", config.signer.signupError.message.c_str());\
  \}\
\
  /* Assign the callback function for the long running token generation task */\
  config.token_status_callback = tokenStatusCallback; //see addons/TokenHelper.h\
  \
  Firebase.begin(&config, &auth);\
  Firebase.reconnectWiFi(true);\
\}\
\
void loop()\{\
  if (Firebase.ready() && signupOK && (millis() - sendDataPrevMillis > 15000 || sendDataPrevMillis == 0))\{\
    sendDataPrevMillis = millis();\
    // Write an Int number on the database path test/int\
    if (Firebase.RTDB.setInt(&fbdo, "test/int", count))\{\
      Serial.println("PASSED");\
      Serial.println("PATH: " + fbdo.dataPath());\
      Serial.println("TYPE: " + fbdo.dataType());\
    \}\
    else \{\
      Serial.println("FAILED");\
      Serial.println("REASON: " + fbdo.errorReason());\
    \}\
    count++;\
    \
    // Write an Float number on the database path test/float\
    if (Firebase.RTDB.setFloat(&fbdo, "test/float", 0.01 + random(0,100)))\{\
      Serial.println("PASSED");\
      Serial.println("PATH: " + fbdo.dataPath());\
      Serial.println("TYPE: " + fbdo.dataType());\
    \}\
    else \{\
      Serial.println("FAILED");\
      Serial.println("REASON: " + fbdo.errorReason());\
    \}\
  \}\
\}\
}